Repository: diSciPy/Book_catalog
Catalog: app/*/LC_MESSAGES/messages.po
Languages: uk_ua

source: This field is required.
uk_ua: Обов'язкове поле.

source: File does not have an approved extension: {extensions}
uk_ua: Формати файлів,які підтримуються: {extensions}

source: File does not have an approved extension.
uk_ua: Формат файлу не підтримується.

source: File must be between {min_size} and {max_size} bytes.
uk_ua: Розмір файлу повинен бути {min_size} - {max_size} байтів

source: Invalid field name '%s'.
uk_ua: Невірна назва поля '%s'.

source: Field must be equal to %(other_name)s.
uk_ua: Поле має співпадати з %(other_name)

source: Field must be at least %(min)d character long.
uk_ua: Поле має містити не менше, ніж %(min)d символ

source: Field cannot be longer than %(max)d character.
uk_ua: Поле має містити не більше, ніж %(max)d символ

source: Field must be exactly %(max)d character long.
uk_ua: Поле має містити %(max)d символ

source: Field must be between %(min)d and %(max)d characters long.
uk_ua: Довжина поля має бути %(min)d - %(max)d символів

source: Number must be at least %(min)s.
uk_ua: Число має бути не менше, ніж %(min)s.

source: Number must be at most %(max)s.
uk_ua: Число має бути не більше, ніж %(max)s.

source: Number must be between %(min)s and %(max)s.
uk_ua: Число має бути в межах від %(min)s до %(max)s

source: Invalid input.
uk_ua: Неправильно введені дані

source: Invalid email address.
uk_ua: Неправильна електронна пошта

source: Invalid IP address.
uk_ua: Неправильна IP-адреса

source: Invalid Mac address.
uk_ua: Неправильна Мас адреса

source: Invalid URL.
uk_ua: Неправильне посилання (URL)

source: Invalid UUID.
uk_ua: Неправильне ІД

source: Invalid value, must be one of: %(values)s.
uk_ua: Неправильне значення, має бути одне з %(values)s

source: Invalid value, can't be any of: %(values)s.
uk_ua: Неправильне значення, не може бути одним з: %(values)s

source: Invalid CSRF Token.
uk_ua: Неправильний CSRF Token

source: CSRF token missing.
uk_ua: CSRF token не доступний

source: CSRF failed.
uk_ua: Неправильний CSRF токен

source: CSRF token expired.
uk_ua: Термін дії CSRF token закінчився

source: Invalid Choice: could not coerce.
uk_ua: Недоступний варіант для вибору

source: Choices cannot be None.
uk_ua: Обов'язкове поле для вибору.

source: Not a valid choice.
uk_ua: Неможливо обрати даний варіант.

source: Invalid choice(s): one or more data inputs could not be coerced.
uk_ua: Один або декілька обраних варіантів не доступні для вибору.

source: '%(value)s' is not a valid choice for this field.
uk_ua: '%(value)s' недоступне для вибору

source: Not a valid datetime value.
uk_ua: Неправильний формат дати.

source: Not a valid date value.
uk_ua: Неправльний формат дати

source: Not a valid time value.
uk_ua: Неправильний формат часу

source: Not a valid integer value.
uk_ua: Непраивльний формат часла

source: Not a valid decimal value.
uk_ua: Непраивльний формат дробового числа

source: Not a valid float value.
uk_ua: Непраивльний формат десяткового дробу

source: This field must be accepted.
uk_ua: Обов'язкове поле.

source: URL does not exist.
uk_ua: URL (посилання) не існує

source: Field must not be equal to %(other_name)s.
uk_ua: Поле не має містити %(other_name)s.

source: Not a valid json
uk_ua: Невалідний json

source: Invalid Email Address.
uk_ua: Неправильна електронна пошта

source: Email Already Exists
uk_ua: Користувач з такою поштою вже зареєстрований

source: Name
uk_ua: Ім'я

source: Name should be between 3 to 15 characters
uk_ua: Ім'я має бути від 3 до 15 символів

source: E-mail
uk_ua: Електронна пошта

source: Password
uk_ua: Пароль

source: confirm
uk_ua: Підтвердити

source: passwords must match
uk_ua: Паролі повинні співпадати

source: Confirm
uk_ua: Підтвердити

source: Register
uk_ua: Зареєструватись

source: stay logged-in
uk_ua: Залишатись залогіненим

source: Log in
uk_ua: Ввійти

source: You are already logged in
uk_ua: Ви вже ввійшли на сайт під своїм користувачем

source: Registration is successful
uk_ua: Реєстрація пройшла успішно

source: You are already verified please log in
uk_ua: Ваш користувач вже верифікований. Ввійдіть на сайт під своїм логіном та паролем

source: Invalid Credentials. Please try again
uk_ua: Неправильний логін/пароль. Спробуйте, будь ласка, ще раз.

source: Thanks for joining
uk_ua: Вітаємо у нашій спільноті

source: Verification of email
uk_ua: Верифікація поштової скриньки

source: Sorry, the page you're looking for could not be found ...
uk_ua: Вибачте, сторінки за таким посиланням не існує...

source: Back home
uk_ua: На домашню сторінку

source: SignIn
uk_ua: Ввійти

source: Login Here
uk_ua: Ввійти

source: Registration
uk_ua: Реєстрація

source: Well done! Your email is verified. Now you can use functionality of Foreign literature web site to the full.
uk_ua: Вітаємо у нашій спільноті! Ваша поштова скринька була успішно верифікована. Чекаємо Вас для подальшого знайомства.

source: Title (english)
uk_ua: Назва (англійською)

source: Title (ukrainian)
uk_ua: Назва (українською)

source: Format (english)
uk_ua: Формат (англійською)

source: Format (ukrainian)
uk_ua: Формат (українською)

source: Author (english)
uk_ua: Автор (англійською)

source: Author (ukrainian)
uk_ua: Автор (українською)

source: Pages
uk_ua: К-сть сторінок

source: Update
uk_ua: Оновити

source: Rating
uk_ua: Рейтинг

source: Image (english)
uk_ua: Обкладинка (англ. варіант)

source: Image (ukrainian)
uk_ua: Обкладинка (укр. варіант)

source: PublisherID
uk_ua: ІД видавництва

source: Create
uk_ua: Додати

source: book {} has been successfully deleted from catalog
uk_ua: Книга "{}"\ була успішно видалена з каталогу

source: Book {} by {} has been edited successfully
uk_ua: Дані книги "{}"\ було успішно оновлено

source: Book "{}" by {} has been successfully added to catalog
uk_ua: Книгу "{}" (автор {}) успішно додано до каталогу

source: Creation of a new book
uk_ua: Додавання нової книги в каталог

source: Are you sure you want to delete this book?
uk_ua: Ви впевнені, що хочете вилучити цю книгу з каталогу?

source: Title
uk_ua: Назва

source: Author
uk_ua: Автор

source: Delete
uk_ua: Видалити

source: Update book
uk_ua: Оновити книгу

source: Authors
uk_ua: Автори

source: Format
uk_ua: Формат

source: Publisher ID
uk_ua: ІД видавництва

source: Edit
uk_ua: Оновити

source: Showing page
uk_ua: Сторінка

source: of
uk_ua: з

source: Foreign literature at hand
uk_ua: Швидкий доступ до іноземної літератури

source: Logged In as
uk_ua: Користувач

source: Not Logged In
uk_ua: Гість

source: Home
uk_ua: Домашня сторінка

source: Sign Out
uk_ua: Вийти

source: Sign In
uk_ua: Ввійти

source: Books by
uk_ua: Книги видавництва

source: by
uk_ua: , автор
